{
  "usuarios": [
    {
      "id": "187cb7e5-e097-4224-8bc7-b610c855e2b1",
      "login": "admin",
      "senha": "dan0310",
      "nome": "Administrador do Sistema",
      "email": "admin@abc.com",
      "admin": true,
      "favoritos": []
    },
    {
      "id": "ec37c83d-4b7f-458d-9e10-3fda7d37cd3e",
      "login": "user",
      "senha": "user123",
      "nome": "Carlos Daniel",
      "email": "user@abc.com",
      "admin": false,
      "favoritos": []
    }
  ],
  "desenvolvedores": [
    {
      "id": "1",
      "nome": "Elon Musk",
      "empresa": "SpaceX e Tesla",
      "bio": "CEO e fundador da SpaceX e líder da Tesla, referência mundial em inovação tecnológica.",
      "imagem": "https://futureoflife.org/wp-content/uploads/2020/08/elon_musk_royal_society.jpg",
      "categoria": "Empreendedor, inventor e visionário tecnológico",
      "contribuicao": "Revolucionou a indústria automotiva com a Tesla, desenvolveu foguetes reutilizáveis com a SpaceX e impulsionou avanços em energia sustentável, transporte e exploração espacial.",
      "ano": "1995 — início da carreira empreendedora / 2002 — fundação da SpaceX / 2004 — entrada na Tesla",
      "nacionalidade": "Sul-africano naturalizado americano",
      "area": "Aeroespacial, energia sustentável, engenharia e tecnologia futurista",
      "destaque": true
    },
    {
      "id": "2",
      "nome": "Ana Souza",
      "empresa": "TechMind",
      "bio": "Engenheira de software e especialista em IA aplicada",
      "imagem": "https://jpimg.com.br/uploads/2020/11/pri3.png",
      "categoria": "Engenheira de Software e Pesquisadora em Inteligência Artificial",
      "contribuicao": "Desenvolveu modelos preditivos utilizados por grandes empresas e liderou projetos de IA voltados para soluções corporativas de automação.",
      "ano": "2016 — início da carreira em tecnologia",
      "nacionalidade": "Brasileira",
      "area": "IA aplicada, machine learning e desenvolvimento de sistemas inteligentes",
      "destaque": false
    },
    {
      "id": "3",
      "nome": "Julia Almeida",
      "empresa": "SoftTech",
      "bio": "Desenvolvedora mobile e UX designer",
      "imagem": "https://www.administradores.com.br/_next/image?url=https%3A%2F%2Fcdn.administradores.com.br%2Fapp%2Fuploads%2F2023%2F08%2F17140849%2FiStock-1401557224-e1692292152697.jpg&w=3840&q=75",
      "categoria": "Desenvolvedora de software",
      "contribuicao": "Criação de interfaces mobile intuitivas e acessíveis",
      "ano": "2018",
      "nacionalidade": "Brasileira",
      "area": "Mobile e UX/UI",
      "destaque": false
    },
    {
      "id": "180d",
      "nome": "Steve Jobs",
      "empresa": "Apple",
      "bio": "Cofundador da Apple e um dos maiores visionários da tecnologia.",
      "imagem": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Steve_Jobs_Headshot_2010-CROP_%28cropped_2%29.jpg/1200px-Steve_Jobs_Headshot_2010-CROP_%28cropped_2%29.jpg",
      "categoria": "Empreendedor e visionário da tecnologia",
      "contribuicao": "Revolucionou a indústria com produtos como Macintosh, iPhone, iPad e iPod",
      "ano": "1976 (fundação da Apple)",
      "nacionalidade": "Americano (nascido na Califórnia)",
      "area": "Computação, design de produtos e eletrônicos de consumo",
      "destaque": true
    },
    {
      "id": "9c89",
      "nome": "Bill Gates",
      "empresa": "Microsoft",
      "bio": "Gates nasceu em uma família de classe média de Seattle. Seu pai, William H. Gates, era advogado de grandes empresas, e sua mãe, Mary Maxwell Gates, foi professora da Universidade de Washington e diretora de bancos...",
      "categoria": "Empreendedor, filantropo e pioneiro da tecnologia.",
      "contribuicao": "Cofundador da Microsoft, empresa responsável por popularizar o computador pessoal e desenvolver sistemas amplamente utilizados, como o Windows e o Microsoft Office.",
      "ano": "Começou na computação ainda jovem. Em 1975, junto com Paul Allen, fundou a Microsoft.",
      "nacionalidade": "Estadunidense (americano).",
      "area": "Tecnologia da informação, negócios e filantropia.",
      "imagem": "https://upload.wikimedia.org/wikipedia/commons/8/88/Bill_Gates_at_the_European_Commission_-_2025_-_P067383-987995_%28cropped%29.jpg",
      "destaque": true
    },
    {
      "id": "daac",
      "nome": "Linus Torvalds",
      "empresa": "Linus",
      "bio": "Linus Benedict Torvalds é um engenheiro de software finlandês, nascido em 28 de dezembro de 1969, na cidade de Helsinki. Conhecer sua biografia é importante, já que ele é mundialmente conhecido por ter sido o criador do Kernel do Linux, base fundamental sobre a qual são construídos diversos sistemas operacionais gratuitos, como as distribuições Linux Ubuntu, Debian, Fedora e etc, além de produtos do Google, como o Chrome OS e o Android.\n\nMais do que criador do Linux, Torvalds é um defensor do software livre e do código aberto, modelo em que o produto do desenvolvimento de programadores é liberado de forma gratuita para uso, modificação e, em alguns casos, exploração pela comunidade. Uma frase famosa de engenheiro é: “código aberto é o único jeito certo de se fazer software”. Fiel a essa visão, Torvalds continua envolvido no processo de desenvolvimento do Linux até hoje como integrante da Linux Foundation – instituição responsável pelo progresso do Kernel sobre o qual o sistema operacional é construído. Além do Linux, o finlandês também é o criador do git, um software usado no desenvolvimento de programas para controle de versão durante o processo de testes e compilações.\n\nEm virtude da sua contribuição decisiva para a popularização do software livre, Torvalds é visto como uma figura de referência no mundo da tecnologia. Suas palestras, TEDs e conferências são eventos aguardados e concorridos por todos que têm interesse em desenvolvimento e engenharia, além da difusão do código aberto e do software livre.",
      "categoria": "Tecnologia / Software Livre / Engenharia de Software",
      "contribuicao": "Criação do Kernel Linux e do sistema de controle de versão Git",
      "ano": "Início dos anos 1990, quando desenvolveu o primeiro núcleo do Linux em 1991 enquanto estudava na Universidade de Helsinki",
      "nacionalidade": "Finlandesa",
      "area": "Engenharia de Software, Desenvolvimento de Sistemas Operacionais, Software Livre, Código Aberto",
      "imagem": "https://s2-techtudo.glbimg.com/sWoIcIiOZMoA2jDau5EpeeiCFNE=/600x0/filters:quality(50)/https://i.s3.glbimg.com/v1/AUTH_08fbf48bc0524877943fe86e43087e7a/internal_photos/bs/2021/m/G/Kb4jJUT3uc0AKkmFFLvA/2011-11-18-linus-torvalds-3.jpg"
    },
    {
      "id": "d594",
      "nome": "Steves Wozniak",
      "empresa": "Apple (cofundador)",
      "bio": "Stephen Gary Wozniak, conhecido como Steve Wozniak ou simplesmente “Woz”, é um engenheiro de computação, inventor e filantropo norte-americano nascido em 11 de agosto de 1950, na Califórnia. Ele ficou mundialmente conhecido por ser o cofundador da Apple ao lado de Steve Jobs e o principal responsável pela engenharia dos primeiros computadores da empresa. Wozniak projetou praticamente sozinho o Apple I e o Apple II, máquinas que revolucionaram o mercado de computadores pessoais pela simplicidade, potência e acessibilidade. Após deixar a Apple nos anos 1980, ele seguiu carreira apoiando projetos educativos, promovendo a inclusão tecnológica e incentivando jovens na área de computação. É considerado um dos maiores engenheiros da história da informática moderna.",
      "categoria": "Tecnologia / Computação / Engenharia Eletrônica",
      "contribuicao": "Criação e engenharia do Apple I e Apple II, que deram origem à revolução dos computadores pessoais",
      "ano": "Década de 1970, quando começou a projetar computadores pessoais e fundou a Apple em 1976",
      "nacionalidade": "Estadunidense (americano)",
      "area": "Engenharia de Computação, Hardware, Tecnologia Educacional, Inovação Tecnológica",
      "imagem": "https://imagenes.elpais.com/resizer/v2/https%3A%2F%2Fep01.epimg.net%2Ftecnologia%2Fimagenes%2F2015%2F10%2F06%2Factualidad%2F1444147938_849814_1444201059_noticia_fotograma.jpg?auth=bf5043be5c2a26d23af6c833b2b68df4d1430c1975e0716a848c943618ac9b0a&width=1960&height=1470&smart=true"
    },
    {
      "id": "3fca",
      "nome": "Martin Forest Eberhard",
      "empresa": "Tesla",
      "bio": "Martin Eberhard é um engenheiro e empreendedor americano, nascido em 15 de maio de 1960, em Berkeley, Califórnia, EUA. Cresceu em Kensington, Califórnia. Ele estudou na University of Illinois Urbana-Champaign, onde obteve bacharelado em Engenharia da Computação em 1982 e mestrado em Engenharia Elétrica em 1984. \n\nAntes de fundar a Tesla, Eberhard atuou como engenheiro elétrico na Wyse Technology, onde projetou o terminal WY-30. \n\n Em 1987, cofundou a empresa Network Computing Devices, Inc. (NCD), onde trabalhou como chefe de engenharia até o IPO da empresa em 1992. \n\nEm 1996, fundou, junto com seu sócio, a NuvoMedia, que desenvolveu o leitor digital pioneiro Rocket eBook — uma das primeiras e-books do mundo com entrega via internet segura de conteúdos. Ele foi CEO da empresa até sua venda para a Gemstar em 2000. \n\n\nEm 2003, Eberhard cofundou Tesla Motors com Marc Tarpenning, impulsionado por sua visão de desenvolver carros elétricos de alto desempenho como alternativa aos veículos a combustão e à dependência do petróleo. \n Ele atuou como primeiro CEO da Tesla até 2007, liderando o desenvolvimento do veículo esportivo elétrico Tesla Roadster, o primeiro carro produzido pela empresa. \n\nApesar de deixar o cargo executivo em 2007 — passando para um papel de conselheiro e, no ano seguinte, saindo da diretoria — ele permaneceu acionista da Tesla. \n\nNos anos posteriores, continuou envolvido no setor de veículos elétricos: em 2016 fundou a startup InEVit, focada em trens de força elétricos e soluções de baterias, que foi adquirida em 2017 pela empresa SF Motors (atual Seres). Ele atuou como Chief Innovation Officer até meados de 2018. \nElectrek\n Em 2019 fundou outra startup, Tiveni, voltada ao desenvolvimento de sistemas inteligentes de baterias para veículos elétricos.\n\nAlém disso, é detentor de múltiplas patentes, considerado um empreendedor veterano do Vale do Silício, e em 2015 foi incluído no hall de ex-alunos distinguidos da sua universidade. ",
      "categoria": "Tecnologia / Mobilidade elétrica / Engenharia",
      "contribuicao": "Cofundador da Tesla Motors; liderança no desenvolvimento do primeiro carro elétrico de alto desempenho da Tesla (Tesla Roadster), responsável por iniciar a transformação do mercado automotivo.  Pioneirismo em soluções de mobilidade elétrica, contribuindo para popularizar a ideia de carros elétricos sérios e desejáveis — não apenas ecológicos, mas com desempenho e design competitivo.  Também trouxe inovação previamente com o Rocket eBook, antecipando tendências de e-books e leitura digital.",
      "ano": "Década de 1980 — formou-se em 1982 (bacharelado) e 1984 (mestrado), trabalhou na Wyse Technology, depois cofundou a Network Computing Devices em 1987.",
      "nacionalidade": "Estadunidense",
      "area": "Engenharia elétrica e de computação; mobilidade elétrica; empreendedorismo em tecnologia automotiva e digital; inovação em hardware/software e baterias.",
      "imagem": "https://speaking.com/wp-content/uploads/2023/12/martin.jpeg"
    },
    {
      "id": "872a",
      "nome": "Lucas Andrade Moretti",
      "empresa": "TechMind",
      "bio": "Lucas Andrade Moretti é um desenvolvedor de software fictício, nascido em 12 de setembro de 1994, em São Paulo. Apaixonado por tecnologia desde a adolescência, iniciou sua trajetória programando pequenos jogos e ferramentas experimentais. Formou-se em Engenharia de Software pela Universidade Paulista e, após atuar como freelancer em diversos projetos de sistemas web, ingressou na empresa TechMind, uma startup de tecnologia especializada em soluções de inteligência artificial e automação empresarial.\n\nNa TechMind, Lucas rapidamente se destacou como um dos principais arquitetos de software da equipe, sendo responsável por liderar o desenvolvimento de uma plataforma de automação inteligente que integra análise de dados, recomendação preditiva e fluxos automatizados. Sua atuação combina habilidades de backend, machine learning e desenvolvimento de APIs robustas.\n\nAlém de seu trabalho técnico, Lucas é defensor da cultura DevOps e do código limpo. Participa de meetups, escreve artigos sobre engenharia de software e atua como mentor interno para novos desenvolvedores. Sua filosofia profissional gira em torno de criar soluções escaláveis, sustentáveis e simples — mesmo em sistemas complexos.",
      "categoria": "Tecnologia / Desenvolvimento de Software / Inteligência Artificial",
      "contribuicao": "Criação e liderança técnica da plataforma “TechMind FlowAI”, solução de automação inteligente utilizada por empresas para otimizar processos, prever gargalos e melhorar a tomada de decisão com base em IA.",
      "ano": "Iniciou em 2014 como desenvolvedor freelancer, passando a atuar profissionalmente em 2017 ao ingressar na TechMind.",
      "nacionalidade": "Brasileira",
      "area": "Desenvolvimento de Software, Arquitetura de Sistemas, Inteligência Artificial, DevOps, APIs e Automação",
      "imagem": "https://images.pexels.com/photos/26150470/pexels-photo-26150470/free-photo-of-empresario-homem-de-negocios-homem-modelo.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
    }
  ]
}